#include <ultra64.h>
// #include "common.h"
#include "objects.h"

extern Gfx D_01011B78_4B448[];

extern Gfx D_050014F0[];
extern Gfx D_01012700_4BFD0[];
extern Gfx D_0101EB20_583F0[];
extern Gfx D_040070F0[];
extern Gfx D_05000250[];
extern Gfx D_0101F580_58E50[];
extern Gfx D_05001A20[];
extern Gfx D_0100BCE0_455B0[];
extern Gfx D_01011FA0_4B870[];
extern Gfx D_0101E2E0_57BB0[];
extern Gfx D_0100F8C0_49190[];
extern Gfx D_05000440[];
extern Gfx D_010122A0_4BB70[];
extern Gfx D_010124F0_4BDC0[];
extern Gfx D_01006C20_404F0[];
extern Gfx D_01012E10_4C6E0[];
extern Gfx D_010183B0_51C80[];
extern Gfx D_040099C0[];
extern Gfx D_0101E600_57ED0[];
extern Gfx D_0100FC50_49520[];
extern Gfx D_04006D00[];
extern Gfx D_01019430_52D00[];
extern Gfx D_0400D160[];
extern Gfx D_0100EC60_48530[];
extern Gfx D_01018B90_52460[];
extern Gfx D_01011CF0_4B5C0[];
extern Gfx D_01011AB0_4B380[];
extern Gfx D_0100F1A0_48A70[];
extern Gfx D_0100F3D0_48CA0[];
extern Gfx D_01018620_51EF0[];
extern Gfx D_01018760_52030[];
extern Gfx D_050000B0[];
extern Gfx D_0100FD60_49630[];
extern Gfx D_0101DE40_57710[];
extern Gfx D_05000740[];
extern Gfx D_01018170_51A40[];
extern Gfx D_05003350[];
extern Gfx D_05003AA0[];
extern Gfx D_01012B80_4C450[];
extern Gfx D_05001FD0[];
extern Gfx D_01017C50_51520[];
extern Gfx D_01017D60_51630[];
extern u8 D_803A8520_7B9BD0[]; // why is this differnt?
extern Gfx D_01017610_50EE0[];
extern Gfx D_01017EB0_51780[];
extern Gfx D_050001C0[];
extern Gfx D_0100E390_47C60[];

extern Gfx D_0400EBC0[];
extern Gfx D_050031F0[];
extern Gfx D_050001D0[];
extern Gfx D_05002570[];
extern Gfx D_0400C060[];
extern Gfx D_040124A0[];
extern Gfx D_0400C8E0[];
extern Gfx D_0400CDF0[];
extern Gfx D_0400D4A0[];
extern Gfx D_0400D7C0[];
extern Gfx D_0400DAE0[];
extern Gfx D_0400DF50[];
extern Gfx D_0400E770[];
extern Gfx D_0400EAA0[];
extern Gfx D_0400EC50[];
extern Gfx D_04010110[];
extern Gfx D_050058F0[];
extern Gfx D_05005B10[];
extern Gfx D_04010820[];
extern Gfx D_05006BE0[];
extern Gfx D_05007840[];
extern Gfx D_050062A0[];
extern Gfx D_05007820[];
extern Gfx D_040118A0[];
extern Gfx D_04012150[];
extern Gfx D_04016DB0[];
extern Gfx D_04010B30[];
extern Gfx D_05009460[];
extern Gfx D_050006F0[];
extern Gfx D_05004640[];
extern Gfx D_050085A0[];
extern Gfx D_05009900[];
extern Gfx D_04014990[];
extern Gfx D_04015960[];
extern Gfx D_05001720[];
extern Gfx D_01020950_5A220[];
extern Gfx D_01017AA0_51370[];
extern Gfx D_040099F0[];

/*
    2   - boulder?
    3   - plant
    4   - ? mouse?
    5   - WEIGHT_FOR_IT_trophy ?
    8   - tunnel
    10  - mushroomy thing
    11  - multiple mushroomy things
    12  - crate
    15  - flowers
    16  - flower stem
    17  - cannonball
    18  - missile
    19  - flower
    21  - crash!
    22  - funnel (trophy from ice level?)
    23  - square base
    24  - active switch
    25  - crate
    26  - flowers
    27  - barrel
    28  - post?
    29  - crash!
    33  - mine
    56  - active teleporter
    58  - purple energy
    59  - less purple energy
    60  - regular energy
    61  - splash?
    62  - active turret
    65  - plant
    66  - plant
    67  - black fog (ala Lost)
    68  - tree
    69  - flower
    70  - flower
    72  - something fishy mine
    74  - spaceship
    80  - powercell
    81  - dead scientist
    82  - dead scientist2 (keycard)
    97  - door
*/

// TODO: properly define Animal
#define Animal void

void func_802F6A5C_70810C(Animal *arg0);
void func_802F8B4C_70A1FC(Animal *arg0);
void func_802F8DCC_70A47C(void *arg0);
void func_802F9084_70A734(void *arg0);
void func_802F908C_70A73C(void *arg0);
void func_802F90A8_70A758(void *arg0);
void func_802F9104_70A7B4(void *arg0);
void func_802F92B0_70A960(void *arg0);
void func_802F951C_70ABCC(void *arg0);
void func_802F9624_70ACD4(void *arg0);
void func_802F96E0_70AD90(void *arg0);
void func_802F9880_70AF30(void *arg0);
void func_802F9A08_70B0B8(void *arg0);
void func_802F9B4C_70B1FC(void *arg0);
void func_802F9C50_70B300(void *arg0);
void func_802FF540_710BF0(void *arg0);
void func_802FF7D4_710E84(void *arg0);
void func_802FF828_710ED8(void *arg0);
void func_802FFA20_7110D0(void *arg0);
void func_802FFC34_7112E4(void *arg0);
void func_802FFE94_711544(void *arg0);
void func_802FFED0_711580(void *arg0);
void func_802FFEFC_7115AC(void *arg0);
void func_802FFF50_711600(void *arg0);
void func_802FFF70_711620(void *arg0);
void func_802FFFD0_711680(void *arg0);
void func_8031AA0C_72C0BC(void *arg0);
void func_8031AE7C_72C52C(void *arg0);

typedef struct {
    /* 0x00 */  s16 id;     // id
    /* 0x02 */  s16 type;   // flags
    /* 0x04 */  Gfx* unk04;  // object display list, is this a 3-item array?
    /* 0x08 */  Gfx* unk08;  // object display list
    /* 0x0C */  Gfx* unk0C;  // object display list
    /* 0x10 */  u8* unk10;  // padding?
    /* 0x14 */  u8  unk14;
    /* 0x15 */  u8  unk15;
    /* 0x16 */  s16 unk16;
    /* 0x18 */  u32 unk18;  // pointer to particle?
    /* 0x1C */  u16 unk1C;  // particle id?
    /* 0x1E */  u16 unk1E;
    /* 0x20 */  s32 unk20;
    /* 0x24 */  s32 unk24;
    /* 0x28 */  s32 unk28;
    /* 0x2C */  u32 unk2C;  // hitbox (per FBM patch)
    /* 0x30 */  u32 unk30;  // hitbox (z?)
    /* 0x34 */  u32 unk34;  // also hitbox?
    /* 0x38 */  s32 unk38;
    /* 0x3C */  u32 unk3C;
    /* 0x40 */  s32 unk40;
    /* 0x44 */  u32 unk44;
    /* 0x48 */  s32 unk48;
    /* 0x4C */  u32 unk4C;
    /* 0x50 */  u32 unk50;
    /* 0x54 */  s32 unk54;
    /* 0x58 */  s32 unk58;
    /* 0x5C */  s32 unk5C;
    /* 0x60 */  s32 unk60;
    /* 0x64 */  s32 unk64;
    /* 0x68 */  s32 unk68;
    /* 0x6C */  s32 unk6C;
    /* 0x70 */  u8  unk70;
    /* 0x71 */  u8  unk71;
    /* 0x72 */  s16 unk72;
    /* 0x74 */  s16 unk74;
    /* 0x76 */  s16 unk76;
    /* 0x78 */  s16 unk78;
    /* 0x7A */  s16 unk7A;
    /* 0x7C */  s16 unk7C;
    /* 0x7E */  s16 unk7E;
    /* 0x80 */  s16 unk80;
    /* 0x82 */  s16 unk82;
    /* 0x84 */  void (*unk84)(); // handler function?
    /* 0x88 */  s16 unk88;
    /* 0x8A */  s16 unk8A;
    /* 0x8C */  s16 unk8C;
    /* 0x8E */  s16 unk8E;
    /* 0x90 */  s16 unk90;
    /* 0x92 */  s16 unk92;
    /* 0x94 */  s16 unk94;
    /* 0x96 */  s16 unk96;
    /* 0x98 */  s16 unk98;
    /* 0x9A */  s16 unk9A;
} Object; // size 0x9C

// TODO: #include each object entry
Object D_803A8528_7B9BD8[] = {
                                                                                                                                          /*hitbox*/
    {   0,      2,          0,          0,          0, 0x00000000,     0,     2,      0, 0x00000000,      0,      0,     0,     0,     0, 0x00000000, 0x00000000, 0x00000000,     0, 0x00000000,     0, 0x00000000,     0, 0x00000000, 0x00000000,     0,     0,     0,     0,     0,     0,     0,     0,     0,      0,      0,     64,     64,      0,      0,      0,      0,   4608,          0,      0,      4,   4096,      0,      0,      0,      0,   4096,      1,      0 },
