#include <ultra64.h>
// #include "common.h"

extern u8 D_01011B78[];

extern u8 D_050014F0[];
extern u8 D_01012700[];
extern u8 D_0101EB20[];
extern u8 D_040070F0[];
extern u8 D_05000250[];
extern u8 D_0101F580[];
extern u8 D_05001A20[];
extern u8 D_0100BCE0[];
extern u8 D_01011FA0[];
extern u8 D_0101E2E0[];
extern u8 D_0100F8C0[];
extern u8 D_05000440[];
extern u8 D_010122A0[];
extern u8 D_010124F0[];
extern u8 D_01006C20[];
extern u8 D_01012E10[];
extern u8 D_010183B0[];
extern u8 D_040099C0[];
extern u8 D_0101E600[];
extern u8 D_0100FC50[];
extern u8 D_04006D00[];
extern u8 D_01019430[];
extern u8 D_0400D160[];
extern u8 D_0100EC60[];
extern u8 D_01018B90[];
extern u8 D_01011CF0[];
extern u8 D_01011AB0[];
extern u8 D_0100F1A0[];
extern u8 D_0100F3D0[];
extern u8 D_01018620[];
extern u8 D_01018760[];
extern u8 D_050000B0[];
extern u8 D_0100FD60[];
extern u8 D_0101DE40[];
extern u8 D_05000740[];
extern u8 D_01018170[];
extern u8 D_05003350[];
extern u8 D_05003AA0[];
extern u8 D_01012B80[];
extern u8 D_05001FD0[];
extern u8 D_01017C50[];
extern u8 D_01017D60[];
extern u8 D_803A8520[];
extern u8 D_01017610[];
extern u8 D_01017EB0[];
extern u8 D_050001C0[];
extern u8 D_0100E390[];
extern u8 D_05002C10[];
extern u8 D_05002D50[];
extern u8 D_040082E0_EF890[];
extern u8 D_05001540[];
extern u8 D_0100E8A0[];
extern u8 D_0400DBF0[];
extern u8 D_01015EE0[];
extern u8 D_01016E90[];
extern u8 D_01019CC0[];
extern u8 D_010196B0[];
extern u8 D_01019870[];
extern u8 D_01019F40[];

extern u8 D_0400B640[];
extern u8 D_050013A0[];
extern u8 D_010201D0[];
extern u8 D_0400E360[];
extern u8 D_0100F638[];
extern u8 D_0100F4F0[];
extern u8 D_050008C0[];
extern u8 D_05001610[];
extern u8 D_05000700[];
extern u8 D_05000AC0[];
extern u8 D_05000190[];
extern u8 D_0400E6F0[];
extern u8 D_05000590[];
extern u8 D_05008D50[];
extern u8 D_05002090[];
extern u8 D_050041B0[];
extern u8 D_050047F0[];
extern u8 D_05004AB0[];
extern u8 D_050054E0[];
extern u8 D_05000690[];
extern u8 D_050014C0[];
extern u8 D_05000E20[];
extern u8 D_05001400[];
extern u8 D_050026B0[];
extern u8 D_05002FF0[];
extern u8 D_0400A810[];
extern u8 D_0400EBC0[];
extern u8 D_050031F0[];
extern u8 D_050001D0[];
extern u8 D_05002570[];
extern u8 D_0400C060[];
extern u8 D_040124A0[];
extern u8 D_0400C8E0[];
extern u8 D_0400CDF0[];
extern u8 D_0400D4A0[];
extern u8 D_0400D7C0[];
extern u8 D_0400DAE0[];
extern u8 D_0400DF50[];
extern u8 D_0400E770[];
extern u8 D_0400EAA0[];
extern u8 D_0400EC50[];
extern u8 D_04010110[];
extern u8 D_050058F0[];
extern u8 D_05005B10[];
extern u8 D_04010820[];
extern u8 D_05006BE0[];
extern u8 D_05007840[];
extern u8 D_050062A0[];
extern u8 D_05007820[];
extern u8 D_040118A0[];
extern u8 D_04012150[];
extern u8 D_04016DB0[];
extern u8 D_04010B30[];
extern u8 D_05009460[];
extern u8 D_050006F0[];
extern u8 D_05004640[];
extern u8 D_050085A0[];
extern u8 D_05009900[];
extern u8 D_04014990[];
extern u8 D_04015960[];
extern u8 D_05001720[];
extern u8 D_01020950[];
extern u8 D_01017AA0[];
extern u8 D_040099F0[];

/*
    2   - boulder?
    3   - plant
    4   - ? mouse?
    5   - WEIGHT_FOR_IT_trophy ?
    8   - tunnel
    10  - mushroomy thing
    11  - multiple mushroomy things
    12  - crate
    15  - flowers
    16  - flower stem
    17  - cannonball
    18  - missile
    19  - flower
    21  - crash!
    22  - funnel (trophy from ice level?)
    23  - square base
    24  - active switch
    25  - crate
    26  - flowers
    27  - barrel
    28  - post?
    29  - crash!
    33  - mine
    56  - active teleporter
    58  - purple energy
    59  - less purple energy
    60  - regular energy
    61  - splash?
    62  - active turret
    65  - plant
    66  - plant
    67  - black fog (ala Lost)
    68  - tree
    69  - flower
    70  - flower
    72  - something fishy mine
    74  - spaceship
    80  - powercell
    81  - dead scientist
    82  - dead scientist2 (keycard)
    97  - door


*/

void D_802F6A5C();
void D_802F8B4C();
void D_802F8DCC();
void D_802F9084();
void D_802F908C();
void D_802F90A8();
void D_802F9104();
void func_802F92B0_70A960(void *arg0); // TODO: Animal
void D_802F951C();
void D_802F9624();
void D_802F96E0();
void D_802F9880();
void D_802F9A08();
void D_802F9B4C();
void D_802F9C50();
void D_802FF540();
void D_802FF7D4();
void D_802FF828();
void D_802FFA20();
void D_802FFC34();
void D_802FFE94();
void D_802FFED0();
void D_802FFEFC();
void D_802FFF50();
void D_802FFF70();
void D_802FFFD0();
void D_8031AA0C();
void D_8031AE7C();

typedef struct {
    /* 0x00 */  s16 id;     // id
    /* 0x02 */  s16 type;   // flags
    /* 0x04 */  u8* unk04;  // object display list, is this a 3-item array?
    /* 0x08 */  u8* unk08;  // object display list
    /* 0x0C */  u8* unk0C;  // object display list
    /* 0x10 */  u8* unk10;  // padding?
    /* 0x14 */  u8  unk14;
    /* 0x15 */  u8  unk15;
    /* 0x16 */  s16 unk16;
    /* 0x18 */  u32 unk18;  // pointer to particle?
    /* 0x1C */  u16 unk1C;  // particle id?
    /* 0x1E */  u16 unk1E;
    /* 0x20 */  s32 unk20;
    /* 0x24 */  s32 unk24;
    /* 0x28 */  s32 unk28;
    /* 0x2C */  u32 unk2C;  // hitbox (per FBM patch)
    /* 0x30 */  u32 unk30;  // hitbox (z?)
    /* 0x34 */  u32 unk34;  // also hitbox?
    /* 0x38 */  s32 unk38;
    /* 0x3C */  u32 unk3C;
    /* 0x40 */  s32 unk40;
    /* 0x44 */  u32 unk44;
    /* 0x48 */  s32 unk48;
    /* 0x4C */  u32 unk4C;
    /* 0x50 */  u32 unk50;
    /* 0x54 */  s32 unk54;
    /* 0x58 */  s32 unk58;
    /* 0x5C */  s32 unk5C;
    /* 0x60 */  s32 unk60;
    /* 0x64 */  s32 unk64;
    /* 0x68 */  s32 unk68;
    /* 0x6C */  s32 unk6C;
    /* 0x70 */  u8  unk70;
    /* 0x71 */  u8  unk71;
    /* 0x72 */  s16 unk72;
    /* 0x74 */  s16 unk74;
    /* 0x76 */  s16 unk76;
    /* 0x78 */  s16 unk78;
    /* 0x7A */  s16 unk7A;
    /* 0x7C */  s16 unk7C;
    /* 0x7E */  s16 unk7E;
    /* 0x80 */  s16 unk80;
    /* 0x82 */  s16 unk82;
    /* 0x84 */  void (*unk84)(); // handler function?
    /* 0x88 */  s16 unk88;
    /* 0x8A */  s16 unk8A;
    /* 0x8C */  s16 unk8C;
    /* 0x8E */  s16 unk8E;
    /* 0x90 */  s16 unk90;
    /* 0x92 */  s16 unk92;
    /* 0x94 */  s16 unk94;
    /* 0x96 */  s16 unk96;
    /* 0x98 */  s16 unk98;
    /* 0x9A */  s16 unk9A;
} Object; // size 0x9C

// TODO: #include each object entry
Object D_803A8528_7B9BD8[] = {
                                                                                                                                          /*hitbox*/
    {   0,      2,          0,          0,          0, 0x00000000,     0,     2,      0, 0x00000000,      0,      0,     0,     0,     0, 0x00000000, 0x00000000, 0x00000000,     0, 0x00000000,     0, 0x00000000,     0, 0x00000000, 0x00000000,     0,     0,     0,     0,     0,     0,     0,     0,     0,      0,      0,     64,     64,      0,      0,      0,      0,   4608,          0,      0,      4,   4096,      0,      0,      0,      0,   4096,      1,      0 },
