#include <ultra64.h>
#include "common.h"

// ========================================================
// definitions
// ========================================================

typedef struct {
    s32 unk0;   // xPos
    s32 unk4;   // zPos
    s32 unk8;   // yPos (next?)
} Vertex2; // size 0xC

typedef struct {
    s16 unk0;   // zRotation
    s16 unk2;   // yRotation
} Rotation; // size 0x4

typedef struct {
    u8 r;
    u8 g;
    u8 b;
} RGB; // size 0x4

typedef struct {
    /* 0x0 */   s8  unk0;
    /* 0x1 */   s8  unk1;
    /* 0x2 */   s8  unk2[48];
    /* 0x32 */  u8  unk32[60];
    /* 0x6E */  s8  unk6E[60];
    /* 0xAA */  u16 unkAA[60];
    /* 0x124 */ Vertex2 unk124[60];
    /* 0x3F4 */ Rotation unk3F4[60];
    /* 0x4E4 */ Gfx *displayList[60];
} struct025; // size 0x5d4 (+4 bytes alignment)

typedef struct {
    /* 0x0 */   s8       unk0;
    /* 0x2 */   u16      unk2[60];
    /* 0x7C */  Vertex2  unk7C[60];
    /* 0x34C */ Rotation unk34C[60];
    /* 0x43C */ Gfx     *displayList[60];
    /* 0x52C */ RGB      color[60];
} struct072; // 0x5e0?

void func_8029E528_6AFBD8(void);
void func_8029E7D0_6AFE80(void);
void func_8029EF20_6B05D0(struct025 *arg0, Gfx **dl);
void func_8029F218_6B08C8(void);
void func_8029F464_6B0B14(struct025 *arg0, u8 arg1, s32 arg2, s32 arg3, s32 arg4, s32 arg5, s16 arg6, s16 arg7, Gfx *arg8);


// ========================================================
// externs
// ========================================================

extern Gfx D_010049E8_3E2B8[];
extern u8  D_010084A0_41D70[];
extern Gfx D_0100A6D0_43FA0[];
extern u8  D_0100A730_44000[];
extern Gfx D_0100AF90_44860[];  // gun turret base
extern Gfx D_0100B2C0_44B90[];  // gun turrent gun
extern Gfx D_0100F4F0_48DC0[];
extern Gfx D_010106E0_49FB0[];
extern Gfx D_01011140_4AA10[];
extern Gfx D_01011B78_4B448[];
extern Gfx D_01012B80_4C450[];  // teleporter

extern u8  D_01031010_6A8E0[];

extern Gfx D_040148B0_114600[];
extern Gfx D_04014990_DC3C0[];  // # piece of silicon valley?
