#include <ultra64.h>
#include "common.h"

// ========================================================
// definitions
// ========================================================

typedef struct {
  u16  flags;
  u8   unk2;  // texture index?
  u8   unk3;  // index? offset?
} struct102_header; // size 0x4

typedef struct {
    s16 tc0;   // tc0 (u)
    s16 tc1;   // tc1 (v)
    u8  red;   // cn[0]
    u8  green; // cn[1]
    u8  blue;  // cn[2]
    u8  unk7;  // x
    s16 unk8;  // y
    u8  unkA;  // z
    u8  alpha; // cn[3]
} struct102_payload; // size 0xC

typedef struct {
  /* 0x00 */ struct102_header header;
  /* 0x04 */ struct102_payload unk4[4];
} struct102; // size 0x34?

typedef struct {
    /* 0x0  */ s16 idx;
    /* 0x2  */ s16 unused; // doesnt really force alignment..
    /* 0x4  */ s16 v[4];
    /* 0xC  */ s16 flags[4]; // has texture?
    /* 0x14 */ s16 unk14[4]; // unused?
    /* 0x1C */ s16 unk1C[4];
} struct115; // size 0x24

void func_803458B8_756F68(Gfx **dl, Vtx *vtx, s16 numVtxs);
void func_803458FC_756FAC(Gfx **dl, struct115 *arg1, s16 numVtxs);
void func_80346878_757F28(Gfx **dl, u8 idx);
void func_803469D4_758084(Gfx **dl, u8 idx);
void func_80346AB0_758160(Gfx **dl, u8 idx);
void func_80346BB4_758264(Gfx **dl, struct115* arg1, s16 numVtxs);


#define VTX_TRIANGLE                0x1
#define VTX_HAS_NEXT                0x2
#define VTX_CULL_BACK               0x4
#define VTX_TRANSLUCENT             0x20
#define VTX_ALPHA_COMPARE_DITHER    0x40
#define VTX_RENDER_MODE_DECAL       0x4000

#define NOT_FOUND                   -100

// ========================================================
// .data
// ========================================================

// ========================================================
// .bss (from D_803F2C80 to D_803F2CD0)
// ========================================================

