#include <ultra64.h>
#include "common.h"

// ========================================================
// definitions
// ========================================================

typedef struct {
    s32 unk0;   // xPos
    s32 unk4;   // zPos
    s32 unk8;   // yPos (next?)
} Vertex2; // size 0xC

typedef struct {
    s16 unk0;   // zRotation
    s16 unk2;   // yRotation
} Rotation; // size 0x4

typedef struct {
    u8 r;
    u8 g;
    u8 b;
} RGB; // size 0x4

struct struct025 {
    /* 0x0 */   s8  unk0;
    /* 0x1 */   s8  unk1;
    /* 0x2 */   s8  unk2[48];
    /* 0x32 */  u8  unk32[60];
    /* 0x6E */  s8  unk6E[60];
    /* 0xAA */  u16 unkAA[60];
    /* 0x124 */ Vertex2 unk124[60];
    /* 0x3F4 */ Rotation unk3F4[60];
    /* 0x4E4 */ Gfx *displayList[60];
}; // size 0x5d4 (+4 bytes alignment)

struct struct072 {
    /* 0x0 */   s8       unk0;
    /* 0x2 */   u16      unk2[60];
    /* 0x7C */  Vertex2  unk7C[60];
    /* 0x34C */ Rotation unk34C[60];
    /* 0x43C */ Gfx     *displayList[60];
    /* 0x52C */ RGB      color[60];
}; // 0x5e0?

void func_8029E528_6AFBD8(void);
void load_dynamic_texture_billboard_texture_pair(Gfx **arg0, s16 arg1);
void render_untextured_colored_display_list_queue(void);
void render_lookat_textured_display_list_queue(void);
void render_texture_grouped_display_list_queue(struct025 *arg0, Gfx **dl);
void render_texture_grouped_display_list_queues(void);
void reset_object_render_queues(void);
void enqueue_distance_sorted_textured_display_list_instance(u8 arg0, u16 arg1, s32 arg2, s32 arg3, s32 arg4, s16 arg5, s16 arg6, Gfx *arg7);
void enqueue_texture_grouped_display_list_instance(struct025 *arg0, u8 arg1, s32 arg2, s32 arg3, s32 arg4, s32 arg5, s16 arg6, s16 arg7, Gfx *arg8);
void enqueue_object_display_list_by_flags(Animal *arg0, u16 arg1, u16 arg2, s32 arg3, s32 arg4, s32 arg5, s16 arg6, s16 arg7, Gfx *arg8);


// ========================================================
// externs
// ========================================================

